nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w4_roundtrip.c
    free_send_context.active = 1U;
    free_send_context.source = (uint32_t)source;
    free_send_context.sequence = sequence;
    free_send_context.buffer_id = id;
    free_send_context.hook_seen = 0U;

    result = xQueueSend(free_queue, &id, 0U);

    if ((result != pdPASS) || (free_send_context.hook_seen == 0U))
    {
        if (source == W4_FREE_SEND_COMPLETE)
        {
            LatchFault(R2_W4_FAULT_RELEASE);
        }
        else
        {
            LatchFault(R2_W4_FAULT_QUEUE_SOURCE);
        }
    }

    free_send_context.active = 0U;
    free_send_context.source = W4_FREE_SEND_NONE;
    free_send_context.sequence = 0U;
    free_send_context.buffer_id = R2_BUFFER_POOL_INVALID_ID;
    free_send_context.hook_seen = 0U;

    return result;
}

void R2_W4_IrqEnter(uint32_t dma_lisr)
{
    irq_enter_cycle = DWT->CYCCNT;
    irq_flags = dma_lisr;
    irq_ct = CurrentCt();
    trace_for_exit = R2_W4_EVENTS;
    irq_should_yield = pdFALSE;
    ++g_r2_w4_result.irq_count;

    if (g_r2_w4_result.phase != R2_W4_RUNNING)
    {
        DisableDmaInterrupts();
        return;
    }

    g_r2_w4_result.dma_error_flags_seen |= dma_lisr & W4_DMA_ERRORS;
    g_r2_w4_result.adc_ovr_seen |= ADC1->SR & ADC_SR_OVR;

    if ((dma_lisr & W4_DMA_ERRORS) != 0U)
    {
        LatchFault(R2_W4_FAULT_DMA);
    }
    else if ((ADC1->SR & ADC_SR_OVR) != 0U)
    {
        LatchFault(R2_W4_FAULT_OVR);
    }
    else if ((dma_lisr & DMA_LISR_TCIF0) == 0U)
    {
        LatchFault(R2_W4_FAULT_EVENT);
    }
}

static void Completed(DMA_HandleTypeDef *dma, uint32_t completed_slot)
{
    uint32_t sequence;
    uint32_t bit;
    uint32_t active_address;
    uint32_t critical_start;
    uint32_t primask;
    uint32_t now;
    uint32_t elapsed;
    uint32_t nominal;
    uint32_t ct_after;
    uint32_t healthy;
    UBaseType_t free_depth;
    UBaseType_t ready_depth;
    BaseType_t hpw = pdFALSE;
    R2_BufferId replacement;
    R2_BufferState replacement_owner;
    R2_DmaSlotsObservation observation;
    R2_DmaSlotsRebindPlan plan;
    R2_DmaSlotsSnapshot mapping;
    R2_BufferPoolSnapshot ownership;
    W4_BlockDescriptor descriptor;
    volatile uint32_t *inactive_address_register;
    volatile uint32_t *active_address_register;
    volatile R2_W4_Trace *trace;

    if ((dma != &hdma_adc1) ||
        (g_r2_w4_result.phase != R2_W4_RUNNING))
    {
        LatchFault(R2_W4_FAULT_EVENT);
        return;
    }

    sequence = g_r2_w4_result.admitted_count + 1U;
    if ((sequence > R2_W4_EVENTS) ||
        ((irq_flags & DMA_LISR_TCIF0) == 0U) ||
        (irq_ct != (sequence & 1U)) ||
        (completed_slot != (irq_ct ^ 1U)))
    {
        LatchFault(R2_W4_FAULT_EVENT);
        return;
    }

    trace_for_exit = sequence - 1U;
    trace = &g_r2_w4_result.trace[trace_for_exit];
    trace->sequence = sequence;
    trace->ct_entry = irq_ct;
    trace->completed_slot = completed_slot;

    if (xQueueReceiveFromISR(free_queue, &replacement, &hpw) != pdPASS)
    {
        ++g_r2_w4_result.free_empty_count;
        LatchFault(R2_W4_FAULT_FREE_EMPTY);
        return;
    }
    if (hpw != pdFALSE)
    {
        irq_should_yield = pdTRUE;
    }

    bit = BitFor(replacement);
    if ((free_token_mask & bit) == 0U)
    {
        LedgerFault();
        return;
    }
    free_token_mask &= ~bit;

    free_depth = uxQueueMessagesWaitingFromISR(free_queue);
    trace->free_depth_after_take = (uint32_t)free_depth;
    if ((uint32_t)free_depth < g_r2_w4_result.min_free_depth)
    {
        g_r2_w4_result.min_free_depth = (uint32_t)free_depth;
    }

    if ((R2_BufferPool_GetState(replacement, &replacement_owner) != R2_BUFFER_POOL_OK) ||
        (replacement_owner != R2_BUFFER_STATE_FREE) ||
        (R2_DmaSlots_ObserveCt(irq_ct, &observation) != R2_DMA_SLOTS_OK) ||
        ((uint32_t)observation.inactive_slot != completed_slot) ||
        (R2_DmaSlots_GetSnapshot(&mapping) != R2_DMA_SLOTS_OK) ||
        (R2_DmaSlots_PrepareInactiveRebind(irq_ct, replacement, &plan) != R2_DMA_SLOTS_OK))
    {
        LatchFault(R2_W4_FAULT_MODEL);
        return;
    }

    trace->completed_id = observation.completed_buffer;
    trace->replacement_id = replacement;

    if ((uint32_t)observation.completed_buffer >= R2_W4_BUFFERS ||
        (DMA2_Stream0->M0AR != Address(mapping.m0_buffer)) ||
        (DMA2_Stream0->M1AR != Address(mapping.m1_buffer)))
    {
        LatchFault(R2_W4_FAULT_ADDRESS);
        return;
    }

    inactive_address_register = completed_slot == 0U ?
        &DMA2_Stream0->M0AR : &DMA2_Stream0->M1AR;
    active_address_register = completed_slot == 0U ?
        &DMA2_Stream0->M1AR : &DMA2_Stream0->M0AR;
    active_address = Address(observation.active_buffer);
    nominal = sequence * R2_W4_BLOCK_CYCLES;

    primask = __get_PRIMASK();
    __disable_irq();
    __DSB();
    critical_start = DWT->CYCCNT;
    trace->ndtr_prewrite = DMA2_Stream0->NDTR;
    healthy = HardwareHealthy();

    if ((g_r2_w4_result.phase != R2_W4_RUNNING) ||
        (R2_DmaSlots_CheckPlanCt(&plan, CurrentCt()) != R2_DMA_SLOTS_OK) ||
        (*active_address_register != active_address) ||
        (*inactive_address_register != Address(observation.completed_buffer)))
    {
        LatchFault(R2_W4_FAULT_PRECHECK);
        __set_PRIMASK(primask);
        return;
    }

    now = DWT->CYCCNT;
    elapsed = now - g_r2_w4_result.epoch_before;
    if (R2_W4_CheckWindow(sequence, irq_ct, CurrentCt(), elapsed,
            trace->ndtr_prewrite, healthy) != R2_W4_GUARD_OK)
    {
        LatchFault(R2_W4_FAULT_PRECHECK);
        __set_PRIMASK(primask);
        return;
    }

    *inactive_address_register = Address(replacement);
    __DSB();
    ct_after = CurrentCt();
    now = DWT->CYCCNT;
    trace->final_window_cycles = now - critical_start;
    trace->nominal_to_commit_cycles = now - g_r2_w4_result.epoch_before - nominal;

    if ((*inactive_address_register != Address(replacement)) ||
        (*active_address_register != active_address) ||
        (ct_after != irq_ct) ||
        (HardwareHealthy() == 0U))
    {
        LatchFault(R2_W4_FAULT_ADDRESS);
    }
    if ((trace->final_window_cycles > R2_W4_FINAL_RESERVE_CYCLES) ||
        (trace->nominal_to_commit_cycles > R2_W4_WRITE_LIMIT_CYCLES))
    {
        LatchFault(R2_W4_FAULT_TIMING);
    }

    __set_PRIMASK(primask);
    if (g_r2_w4_result.fault_bits != 0U)
    {
        return;
    }

    if ((R2_DmaSlots_CommitPreparedRebind(&plan) != R2_DMA_SLOTS_OK) ||
        (R2_BufferPool_CommitDmaRotation(
            observation.completed_buffer, replacement) != R2_BUFFER_POOL_OK))
    {
        LatchFault(R2_W4_FAULT_MODEL);
        return;
    }

    descriptor.sequence = sequence;
    descriptor.buffer_id = observation.completed_buffer;
    descriptor.completed_slot = completed_slot;
    if (R2_DmaSlots_GetSnapshot(&mapping) != R2_DMA_SLOTS_OK)
    {
        LatchFault(R2_W4_FAULT_MODEL);
        return;
    }
    descriptor.mapping_epoch = mapping.mapping_epoch;
    trace->mapping_epoch_after = mapping.mapping_epoch;

    bit = BitFor(descriptor.buffer_id);
    if ((ready_token_mask & bit) != 0U)
    {
        LedgerFault();
        return;
    }

    hpw = pdFALSE;
    if (xQueueSendFromISR(ready_queue, &descriptor, &hpw) != pdPASS)
    {
        ++g_r2_w4_result.ready_send_fail_count;
        LatchFault(R2_W4_FAULT_READY_FULL);
        return;
    }
    ready_token_mask |= bit;
    if (hpw != pdFALSE)
    {
        irq_should_yield = pdTRUE;
    }

    ready_depth = uxQueueMessagesWaitingFromISR(ready_queue);
    trace->ready_depth_after_publish = (uint32_t)ready_depth;
    if ((uint32_t)ready_depth > g_r2_w4_result.max_ready_depth)
    {
        g_r2_w4_result.max_ready_depth = (uint32_t)ready_depth;
    }

    hpw = pdFALSE;
    if (xTaskNotifyFromISR(processing_task_handle, W4_WORK_BIT,
            eSetBits, &hpw) != pdPASS)
    {
        ++g_r2_w4_result.notification_fail_count;
        LatchFault(R2_W4_FAULT_EVENT);
        return;
    }
    if (hpw != pdFALSE)
    {
        irq_should_yield = pdTRUE;
    }

    ++g_r2_w4_result.admitted_count;
    ++g_r2_w4_result.admitted_by_buffer[descriptor.buffer_id];

