nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w4_roundtrip.c
    g_r2_w4_result.dma_error_flags_seen |= DMA2->LISR & W4_DMA_ERRORS;
    g_r2_w4_result.adc_ovr_seen |= ADC1->SR & ADC_SR_OVR;

    status = HAL_ADC_Stop_DMA(&hadc1);
    DMA2->LIFCR = W4_ALL_FLAGS;
    HAL_NVIC_ClearPendingIRQ(DMA2_Stream0_IRQn);
    __DSB();

    if ((DMA2_Stream0->CR & DMA_SxCR_EN) != 0U)
    {
        return HAL_ERROR;
    }

    return status;
}

static void ProcessDescriptor(const W4_BlockDescriptor *descriptor)
{
    uint32_t id = descriptor->buffer_id;
    uint32_t sequence = descriptor->sequence;
    uint32_t bit;
    uint32_t min_value = UINT32_MAX;
    uint32_t max_value = 0U;
    uint32_t j;
    R2_BufferState state;
    volatile R2_W4_Trace *trace;

    if ((sequence == 0U) ||
        (sequence > R2_W4_EVENTS) ||
        (id >= R2_W4_BUFFERS) ||
        (descriptor->mapping_epoch != sequence + 1U))
    {
        LatchFault(R2_W4_FAULT_PROCESSING);
        return;
    }

    trace = &g_r2_w4_result.trace[sequence - 1U];
    bit = BitFor((R2_BufferId)id);

    taskENTER_CRITICAL();
    if (((ready_token_mask & bit) == 0U) ||
        (R2_BufferPool_GetState((R2_BufferId)id, &state) != R2_BUFFER_POOL_OK) ||
        (state != R2_BUFFER_STATE_READY) ||
        (R2_BufferPool_ClaimReady((R2_BufferId)id) != R2_BUFFER_POOL_OK))
    {
        taskEXIT_CRITICAL();
        LatchFault(R2_W4_FAULT_PROCESSING);
        return;
    }
    ready_token_mask &= ~bit;
    taskEXIT_CRITICAL();

    trace->processing_begin_offset_cycles =
        DWT->CYCCNT - g_r2_w4_result.epoch_before;

    if ((buffers[id].guard_lo != W4_GUARD_LO) ||
        (buffers[id].guard_hi != W4_GUARD_HI))
    {
        ++g_r2_w4_result.canary_errors;
        LatchFault(R2_W4_FAULT_SAMPLES);
        return;
    }

    for (j = 0U; j < R2_W4_BLOCK_SAMPLES; ++j)
    {
        uint32_t value = buffers[id].samples[j];
        if (value > 4095U)
        {
            ++g_r2_w4_result.sample_errors;
        }
        else
        {
            ++g_r2_w4_result.full_sample_count;
        }
        if (value < min_value)
        {
            min_value = value;
        }
        if (value > max_value)
        {
            max_value = value;
        }
    }

    trace->raw_min = min_value;
    trace->raw_max = max_value;
    trace->processing_end_offset_cycles =
        DWT->CYCCNT - g_r2_w4_result.epoch_before;

    if (g_r2_w4_result.sample_errors != 0U)
    {
        LatchFault(R2_W4_FAULT_SAMPLES);
        return;
    }

    if (SendFreeToken(W4_FREE_SEND_COMPLETE,
            (R2_BufferId)id, sequence) != pdPASS)
    {
        LatchFault(R2_W4_FAULT_RELEASE);
        return;
    }

    ++g_r2_w4_result.processed_count;
    ++g_r2_w4_result.released_count;
    ++g_r2_w4_result.processed_by_buffer[id];
    ++g_r2_w4_result.released_by_buffer[id];
    trace->processed_ok = 1U;
}

static void ProcessingTask(void *argument)
{
    uint32_t notification_value;
    W4_BlockDescriptor descriptor;
    (void)argument;

    for (;;)
    {
        notification_value = 0U;
        (void)xTaskNotifyWait(0U, UINT32_MAX,
            &notification_value, portMAX_DELAY);

        if ((notification_value & W4_WORK_BIT) != 0U)
        {
            while (xQueueReceive(ready_queue, &descriptor, 0U) == pdPASS)
            {
                ProcessDescriptor(&descriptor);
                if (g_r2_w4_result.fault_bits != 0U)
                {
                    break;
                }
            }
        }
    }
}

static void Finalize(void)
{
    R2_BufferPoolSnapshot pool;
    R2_DmaSlotsSnapshot slots;
    uint32_t expected_free_mask = 0U;
    uint32_t id;

    if ((R2_BufferPool_GetSnapshot(&pool) != R2_BUFFER_POOL_OK) ||
        (R2_DmaSlots_GetSnapshot(&slots) != R2_DMA_SLOTS_OK))
    {
        LatchFault(R2_W4_FAULT_MODEL);
        return;
    }

    g_r2_w4_result.pool_at_stop = pool;
    g_r2_w4_result.slots_at_stop = slots;
    g_r2_w4_result.free_queue_depth_final =
        (uint32_t)uxQueueMessagesWaiting(free_queue);
    g_r2_w4_result.ready_queue_depth_final =
        (uint32_t)uxQueueMessagesWaiting(ready_queue);
    g_r2_w4_result.free_token_mask_final = free_token_mask;
    g_r2_w4_result.ready_token_mask_final = ready_token_mask;

    for (id = 0U; id < R2_W4_BUFFERS; ++id)
    {
        if ((buffers[id].guard_lo != W4_GUARD_LO) ||
            (buffers[id].guard_hi != W4_GUARD_HI))
        {
            ++g_r2_w4_result.canary_errors;
        }
        if (pool.states[id] == R2_BUFFER_STATE_FREE)
        {
            expected_free_mask |= 1UL << id;
        }
        if ((g_r2_w4_result.admitted_by_buffer[id] == 0U) ||
            (g_r2_w4_result.processed_by_buffer[id] == 0U) ||
            (g_r2_w4_result.released_by_buffer[id] == 0U))
        {
            LatchFault(R2_W4_FAULT_PROCESSING);
        }
    }

    if ((pool.k != R2_W4_K) ||
        (pool.active_count != R2_W4_BUFFERS) ||
        (pool.free_count != R2_W4_K) ||
        (pool.ready_count != 0U) ||
        (pool.processing_count != 0U) ||
        (pool.dma_owned_count != 2U) ||
        (pool.violation_count != 0U) ||
        (slots.violation_count != 0U) ||
        (slots.m0_buffer == slots.m1_buffer) ||
        (pool.states[slots.m0_buffer] != R2_BUFFER_STATE_DMA_OWNED) ||
        (pool.states[slots.m1_buffer] != R2_BUFFER_STATE_DMA_OWNED) ||
        (g_r2_w4_result.free_queue_depth_final != R2_W4_K) ||
        (g_r2_w4_result.ready_queue_depth_final != 0U) ||
        (ready_token_mask != 0U) ||
        (free_token_mask != expected_free_mask) ||
        ((free_token_mask | BitFor(slots.m0_buffer) |
          BitFor(slots.m1_buffer)) != W4_ALL_BUFFER_MASK))
    {
        LatchFault(R2_W4_FAULT_MODEL);
    }

    if ((g_r2_w4_result.admitted_count != R2_W4_EVENTS) ||
        (g_r2_w4_result.processed_count != R2_W4_EVENTS) ||
        (g_r2_w4_result.released_count != R2_W4_EVENTS) ||
        (g_r2_w4_result.completion_hook_count != R2_W4_EVENTS) ||
        (g_r2_w4_result.init_hook_count != R2_W4_K) ||
        (g_r2_w4_result.illegal_free_send_count != 0U) ||
        (g_r2_w4_result.free_empty_count != 0U) ||
        (g_r2_w4_result.ready_send_fail_count != 0U) ||
        (g_r2_w4_result.notification_fail_count != 0U) ||
        (g_r2_w4_result.token_ledger_errors != 0U) ||
        (g_r2_w4_result.dma_error_flags_seen != 0U) ||
        (g_r2_w4_result.adc_ovr_seen != 0U) ||
        (g_r2_w4_result.full_sample_count !=
         R2_W4_EVENTS * R2_W4_BLOCK_SAMPLES) ||
        (g_r2_w4_result.sample_errors != 0U) ||
        (g_r2_w4_result.canary_errors != 0U))
    {
        LatchFault(R2_W4_FAULT_EVENT);
    }
}

static void ControlTask(void *argument)
{
    uint32_t id;
    uint32_t j;
    TickType_t start_tick;
    TickType_t drain_tick;
    HAL_StatusTypeDef status;
    (void)argument;

    vTaskDelay(pdMS_TO_TICKS(100U));

